Repository: Jabez1/BMC304Flutter
Catalog: lib/l10n/app_*.arb
Languages: ms, zh

# appName
source: Clinic Finder
ms: Cari Klinik
zh: 找诊所

source: Login
ms: log masuk
zh: 登录

source: Login Page
ms: Halaman Log Masuk
zh: 登录页面

# insertCase
source: Insert a New Case
ms: Masukkan Kes Baharu
zh: 插入新案例

source: Manage Covid Cases
ms: Urusan Kes Covid
zh: 管理 Covid 病例

source: Manage Death Cases
ms: Urusan Kes Kematian
zh: 管理死亡案例

source: Manage Clinics
ms: Urusan Kliniks
zh: 管理诊所

# updateCase
source: Update a Case
ms: Kemas Kini Kes
zh: 更新一个案例

# covidStats
source: Covid Statistics
ms: Perangkaan Covid
zh: Covid 统计数据

# findClinic
source: Find Nearest Clinic
ms: Cari Klinik Terdekat
zh: 查找最近的诊所

source: Submit
ms: Hantar
zh: 提交

source: Confirm
ms: Sah
zh: 确认

source: Cancel
ms: Batal
zh: 取消

source: Edit
ms: Sunting
zh: 编辑

source: Delete
ms: Padam
zh: 删除

source: Update
ms: Kemas kini
zh: 更新

source: Add New Center Info
ms: Tambah Maklumat Pusat Baharu

# centerSuccess
source: Vaccination Center Added Successfully . . .
ms: Pusat Vaksinasi Berjaya Ditambah . . .
zh: 疫苗接种中心添加成功! ! !

# updateCenter
source: Update Center Info
ms: Kemas Kini Maklumat Pusat
zh: 更新中心信息

# centerUpSuccess
source: Vaccination Center Updated !
ms: Pusat Vaksinasi Dikemaskini !
zh: 疫苗接种中心更新 !

# viewCenter
source: Vaccination Center List
ms: Senarai Pusat Vaksinasi
zh: 疫苗接种中心名单

# dismiss
source: had been dismissed
ms: telah dipadamkan
zh: 已被解雇了

# confirmDelete
source: Delete Confirmation
ms: Padamkan Pengesahan
zh: 删除确认

# questionDeleteCenter
source: Are you sure you wish to delete this center info ?
ms: Adakah anda pasti mahu memadamkan maklumat pusat ini ?
zh: 您确定要删除此中心信息吗？

# questionDeleteItem
source: Are you sure you wish to delete this item?
ms: Adakah anda pasti mahu memadamkan item ini ?
zh: 你确定要删除这个项目吗？

# confirmUpdate
source: Update Confirmation
ms: Kemas kini Pengesahan
zh: 更新确认

# questionUpCenter
source: Are you sure you wish to update this center info ?
ms: Adakah anda pasti ingin mengemas kini maklumat pusat ini ?
zh: 您确定要更新此中心信息吗？

# questionUpItem
source: Are you sure you wish to update this item ?
ms: Adakah anda pasti ingin mengemas kini item ini ?
zh: 你确定要更新这个项目吗？

source: Center Name
ms: Nama Pusat
zh: 中心名称

source: Address
ms: Alamat
zh: 地址

source: Latitude
ms: Latitud
zh: 纬度

source: Longitude
ms: Longitud
zh: 经度

source: Vaccine Name
ms: Nama Vaksin
zh: 疫苗名称

source: Amount Left
ms: Jumlah yang Tinggal
zh: 剩余金额

source: Phone
ms: Nombor telefon
zh: 电话号码

# enterCenter
source: Enter center name here
ms: Masukkan nama pusat di sini
zh: 输入中心名称

# enterAddress
source: Enter address here
ms: Masukkan alamat di sini
zh: 输入地址

# enterLatitude
source: Enter latitude here
ms: Masukkan latitud di sini
zh: 输入纬度

# enterLongitude
source: Enter longitude here
ms: Masukkan longitud di sini
zh: 输入经度

# enterVaccine
source: Enter vaccine name here
ms: Masukkan nama vaksin di sini
zh: 输入疫苗名称

# enterAmount
source: Enter amount left here
ms: Masukkan jumlah yang tinggal di sini
zh: 输入剩余金额

# enterPhone
source: Enter phone here
ms: Masukkan nombor telefon di sini
zh: 输入电话号码

# enterDate
source: Enter the date
ms: Masukkan tarikh
zh: 输入日期

# enterNumberCovid
source: Enter the number of Covid
ms: Masukkan bilangan kes Covid
zh: 输入 Covid 的编号

source: Date
ms: Tarikh
zh: 日期

# dateValid
source: Please enter a date
ms: Sila masukkan tarikh
zh: 请输入日期

source: Covid count
ms: Kiraan covid
zh: 新冠病毒计数

# numberValid
source: Please enter valid number
ms: Sila masukkan nombor yang sah
zh: 请输入有效号码

# caseAddedSuccess
source: Case has been Added!
ms: Kes telah Ditambah!
zh: 已添加案例！

# caseUpdate
source: Case Updated!
ms: Kes Dikemas Kini!
zh: 案例更新！

# requireValid
source: require a value here
ms: memerlukan nilai di sini
zh: 这里需要一个值

source: Statistics
ms: Perangkaan
zh: 统计数据

# newCases
source: New Covid Cases
ms: Kes Covid Baharu
zh: 新的 Covid 病例

# newDeath
source: New Covid Deaths
ms: Kematian Covid Baharu
zh: 新的 Covid 死亡人数

# dailyCaseTitle
source: Daily New Covid Cases for the past 3 months
ms: Kes Covid Baharu Harian selama 3 bulan yang lalu
zh: 过去 3 个月的每日新增 Covid 病例

# monthlyCaseTitle
source: Monthly Covid Cases for the past 3 months
ms: Kes Covid Bulanan selama 3 bulan yang lalu
zh: 过去 3 个月的每月 Covid 病例

# dailyDeathTitle
source: Daily Covid Deaths for the past 3 months
ms: Kematian Covid Harian selama 3 bulan yang lalu
zh: 过去 3 个月的每日 Covid 死亡人数

# monthlyDeathTitle
source: Monthly Covid Deaths for the past 3 months
ms: Kematian Covid Bulanan selama 3 bulan yang lalu
zh: 过去 3 个月的每月 Covid 死亡人数

# updateDeathTitle
source: Update Death Cases for a date
ms: Kemas kini Kes Kematian untuk satu tarikh
zh: 更新日期的死亡案例

# insertCaseTitle
source: Insert New Case
ms: Masukkan Kes Baharu
zh: 插入新案例

# insertDeathTitle
source: Insert Death Cases for a date
ms: Masukkan Kes Kematian untuk tarikh
zh: 插入日期的死亡案例

# listCovid
source: List of Covid Cases
ms: Senarai Kes Covid
zh: Covid病例清单

# dateCovidCases
source: Date of Covid Cases:
ms: Tarikh Kes Covid:
zh: Covid案件的日期:

# newCovidCount
source: New Covid Case Count:
ms: Kiraan Kes Covid Baharu:
zh: 新的 Covid 病例数:

# listDeath
source: List of Death Cases
ms: Senarai Kes Kematian
zh: 死亡病例清单

# dateDeathCases
source: Date of Deaths:
ms: Tarikh Kematian:
zh: 死亡日期:

# newDeathCount
source: Death Count:
ms: Kiraan Kematian:
zh: 死亡人数:
